BAS BMEKZU Project/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРождения</name>
    <comment>Дата рождения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоДРФО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <comment>Пол</comment>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтраховойНомерПФ</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоРождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>240</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПол</name>
    <comment>Пол</comment>
    <type>
      <types>EnumRef.УдалитьПолФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Дата регистрации</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСлужебное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УНЗР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставСемьи</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>СтепеньРодства</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.СтепениРодстваФизЛиц</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ГодРождения</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Иждивенец</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИНАГРО_Образование</name>
    <attributes>
      <name>ВидОбразования</name>
      <type>
        <types>CatalogRef.ИНАГРО_ВидыОбразованияФизЛиц</types>
      </type>
    </attributes>
    <attributes>
      <name>УчебноеЗаведение</name>
      <type>
        <types>CatalogRef.ИНАГРО_УчебныеЗаведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Специальность</name>
      <type>
        <types>CatalogRef.ИНАГРО_КлассификаторСпециальностейПоОбразованию</types>
      </type>
    </attributes>
    <attributes>
      <name>Диплом</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГодОкончания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Факультет</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УченаяСтепень</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФормаОбучения</name>
      <type>
        <types>EnumRef.ИНАГРО_ФормыОбучения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИНАГРО_ТрудоваяДеятельность</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BAS BMEKZU Project/src/CommonModules/скEDI_НастройкиПодКонфигурациюБП/Module.bsl
Функция БП_ДанныеФизЛица(Организация, ФизЛицо, Дата) Экспорт
	ИДКонфигурации  = скEDI_НастройкиПодКонфигурацию.ИДКонфигурации();
	
	ДанныеФизЛица = Неопределено;
	
	Если ИДКонфигурации = "БП"
		ИЛИ ИДКонфигурации = "УТП"
		ИЛИ ИДКонфигурации = "УПП" Тогда
		Выполнить("ДанныеФизЛица = ОбщегоНазначения.ДанныеФизЛица(Организация, ФизЛицо, Дата);");
	ИначеЕсли ИДКонфигурации = "БП20" Тогда
		Выполнить("ДанныеФизЛица = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Организация, ФизЛицо, Дата);");
	ИначеЕсли ИДКонфигурации = "УНФ" Тогда
		Выполнить("ДанныеФизЛица = Справочники.ФизическиеЛица.ДанныеФизЛица(Организация, ФизЛицо, Дата);");
	ИначеЕсли ИДКонфигурации = "УТ30"
		ИЛИ ИДКонфигурации = "УТ31" 
		//ИЛИ ИДКонфигурации = "FlyDoc" 
		Тогда
		Выполнить("ДанныеФизЛица = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Организация, ФизЛицо, Дата);");
	ИначеЕсли ИДКонфигурации = "BASУТ" ИЛИ ИДКонфигурации = "BASКУП" ИЛИ ИДКонфигурации = "BASERP" Тогда
		
		ДанныеФИО = Неопределено;
		
		Выполнить("ДанныеФИО = ФизическиеЛицаУТ.ФамилияИмяОтчество(ФизЛицо, Дата);");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветственныеЛицаОрганизаций.Должность
		|ИЗ
		|	Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
		|ГДЕ
		|	ОтветственныеЛицаОрганизаций.ФизическоеЛицо = &ФЛ";
		
		Запрос.УстановитьПараметр("ФЛ", ФизЛицо);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
				
		ДанныеФизЛица = Новый Структура;
		ДанныеФизЛица.Вставить("Должность", Выборка.Должность);
		ДанныеФизЛица.Вставить("Фамилия", ДанныеФИО.Фамилия);
		ДанныеФизЛица.Вставить("Имя", ДанныеФИО.Имя);
		ДанныеФизЛица.Вставить("Отчество", ДанныеФИО.Отчество);
	//ИначеЕсли ИДКонфигурации = "УТ" Тогда
	КонецЕсли;
	Возврат ДанныеФизЛица;
КонецФункции

Функция БП_ПолучитьФИО(Организация, ФизЛицо, Дата) Экспорт
	ДанныеФизЛица = БП_ДанныеФизЛица(Организация, ФизЛицо, Дата);
	ФИОФизЛица = ?(ДанныеФизЛица.Фамилия = Неопределено, "", ДанныеФизЛица.Фамилия + " ") + 
						?(ДанныеФизЛица.Имя = Неопределено, "", ДанныеФизЛица.Имя + " ") +
						?(ДанныеФизЛица.Отчество = Неопределено, "", ДанныеФизЛица.Отчество);
	Возврат СокрЛП(ФИОФизЛица);
КонецФункции

Функция БП_ПолучитьДолжность(Организация, ФизЛицо, Дата) Экспорт
	ДанныеФизЛица = БП_ДанныеФизЛица(Организация, ФизЛицо, Дата);
	ДолжностьФизЛица = СокрЛП(ДанныеФизЛица.Должность);
	Возврат ДолжностьФизЛица;
КонецФункции

Функция БП_ПолучитьДолжностьФИО(Организация, ФизЛицо, Дата) Экспорт
	ДанныеФизЛица = БП_ДанныеФизЛица(Организация, ФизЛицо, Дата);
	ДолжностьФизЛица = СокрЛП(ДанныеФизЛица.Должность);
	
	ДолжностьФИОФизЛица = ?(ЗначениеЗаполнено(ДолжностьФизЛица), ДолжностьФизЛица + " ", "") + 
						?(ДанныеФизЛица.Фамилия = Неопределено, "", ДанныеФизЛица.Фамилия + " ") + 
						?(ДанныеФизЛица.Имя = Неопределено, "", ДанныеФизЛица.Имя + " ") +
						?(ДанныеФизЛица.Отчество = Неопределено, "", ДанныеФизЛица.Отчество);
	Возврат СокрЛП(ДолжностьФИОФизЛица);
КонецФункции
